{
    "posts": [
        {
            "postName": "DevLog Post #002 - Site updates",
            "postId": 0,
            "date": "2/20/2021",
            "postImage": "defaultImage",
            "tags": "Development - Web",
            "snippet": "Here's an update post on my devLog site.",
            "content": "After working for about 2 hours I needed to create another post to have more content, this one might be deleted soon though."
        },
        {
            "postName": "DevLog Post #001",
            "postId": 1,
            "date": "2/21/2021",
            "postImage": "defaultImage",
            "tags": "Development - Unity",
            "snippet": "Two weeks ago I started learning Game Development. After looking at some of the options including the Unreal Engine, Godot, and Unity I, like many others, chose Unity for the simplicity and somewhat beginner friendly development path that it provides.",
            "content": "Since then I learned Blender for 3D modelling and have watched countless hours of videos from content creators like [Brackeys](https://www.youtube.com/channel/UCYbK_tjZ2OrIZFBvU6CCMiA) and [Blender Guru](https://www.youtube.com/channel/UCOKHwx1VCdgnxwbjyb9Iu1g) along with a few others who have taught me most of what I know now. I've even been watching [Dani](https://www.youtube.com/channel/UCIabPXjvT5BVTxRDPCBBOOQ) for entertainment that is also related to game development. Just today I decided that I needed to update some of the sites that I have had on my resume for a while now, especially since recently the databases have been shut down by Heroku. It wouldn't be the worst idea to go back and rework and update them to work again, but the ideas I came up with back then weren't the greatest anyways so making something like this DevLog site that you're reading now seemed like a better idea. It's also pretty cliche to create a \"blog\" like site as a developer, so I went on to create that. Anyways I'm creating this first post after getting the basic posts working by just grabbing data from a JSON file that I've manually made so the next post will be once it actually looks like a website."
        }
    ]
}